app/controllers/school_classes_controller.rb

    def update
        @school_class.update(school_class_params)
---
UPDATE "school_classes" SET "title" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "The Stars' Tennis Ball"], ["updated_at", "2021-03-21 20:21:47.715916"], ["id", 20]]

    def find_school_classes
        @school_class = SchoolClass.find(params[:id])
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]