app/controllers/students_controller.rb

SELECT "students".* FROM "students"
---
    def index
        # byebug
        @students = Student.all

UPDATE "students" SET "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["last_name", "Schim"], ["updated_at", "2021-03-21 18:18:13.724974"], ["id", 50]]
---
    def update
        @student.update(student_params)

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
    def find_student
        @student = Student.find(params[:id])